Documents/НБКИ_УстановкаУникальныхЗначенийДляСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НБКИ_УстановкаУникальныхЗначенийДляСделок</Name>
			<Comment>для блоков 17.2 и 10.2</Comment>
			<BasedOn>
				<xr:Item>Document.НБКИДокументКорректировкаRUTDF</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КредитныеИстории_УникальныеЗначенияСделок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстановитьВКачествеОсновных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУникальногоЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НБКИ_ТипыУникальныхЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыДляУстановки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДпоГОСТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>38</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/НБКИ_ТипыУникальныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>НБКИ_ТипыУникальныхЗначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УИДПоГОСТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НБКИ_УстановкаУникальныхЗначенийДляСделок/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Асинх Процедура СоздатьУникальныеЗначенияПоГОСТНаСервере()
	
	ОбещаниеАдаптеры  = ПолучитьИнформациюОСетевыхАдаптерахАсинх();
	РезАдаптеры = Ждать ОбещаниеАдаптеры;
	Адаптер = РезАдаптеры[0];	
	АдресСетевойКарты = Адаптер.MACАдрес; 
	
	Для Каждого СтрокаУстановки ИЗ Объект.ОбъектыДляУстановки Цикл 
		
		УУИД = ОбъектыСервер.СформироватьUUIDver1(ОбщегоНазначенияКлиент.ДатаСеанса(), АдресСетевойКарты);
		UIDНБКИ = УУИД + "-" + ОбъектыСервер.СгенерироватьКонтрольныйСимвол(УУИД); 
		СтрокаУстановки.УИДпоГОСТ = UIDНБКИ;
		
		
	КонецЦикла;	
	Объект.ТипУникальногоЗначения = ОбъектыСервер.РазыменоватьСсылку(Неопределено, "Перечисления.НБКИ_ТипыУникальныхЗначений.УИДПоГОСТ");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУникальныеЗначенияПоГОСТ(Команда)
	СоздатьУникальныеЗначенияПоГОСТНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОбъектыДляУстановкиСоздатьУникальныеЗначенияПоГОСТ.Доступность = НЕ Объект.Проведен;
КонецПроцедуры
